       IDENTIFICATION DIVISION.              
       PROGRAM-ID.    EAD71901.              
       AUTHOR.        THIAGO.                
      ***********************************    
      *'    MEU PRIMEIRO PROGRAMA       '    
      ***********************************    
      *                                      
       ENVIRONMENT DIVISION.                 
      *                                      
       DATA DIVISION.                        
      *                                      
       PROCEDURE DIVISION.                   
       UNICA SECTION.                        
       INICIO.                               
           DISPLAY 'MEU PRIMEIRO PROGRAMA'.  
           STOP RUN.                         